export default function selectTab(e) {
  let elem = document.querySelector(".app-information__container");
  let menu = {
    epic: `<svg class ="svg-icon" viewBox="0 0 128 128" xmlns="http://www.w3.org/2000/svg"><style></style><path d="M120 32v-8H96v8h8v12h-8v8h-8c0-4.4-3.6-8-8-8h-.2c.1-.6.2-1.3.2-2 0-5.5-4.5-10-10-10H58c-5.5 0-10 4.5-10 10 0 .7.1 1.4.2 2H48c-4.4 0-8 3.6-8 8h-8v-8h-8V32h8v-8H8v8h8v12H8v12c0 6.6 5.4 12 12 12 5.2 0 9.6-3.3 11.3-8H40v14.3l-8 8V104h8V85.7l5.7-5.7H60v4h-4v4h-8v24h32V88h-8v-4h-4v-4h14.3l5.7 5.7V104h8V82.3l-8-8V60h8.7c1.7 4.7 6.1 8 11.3 8 6.6 0 12-5.4 12-12V44h-8V32h8zM24 56c0 2.2-1.8 4-4 4s-4-1.8-4-4v-4h8v4zm34-16h12c1.1 0 2 .9 2 2s-.9 2-2 2H58c-1.1 0-2-.9-2-2s.9-2 2-2zm14 56v8H56v-8h16zm8-24H48V52h32v20zm32-16c0 2.2-1.8 4-4 4s-4-1.8-4-4v-4h8v4z"/></svg>`,
    epicTitle: "Epic",
    epicText:
      "На этой странице вы найдете изображение нашей плнеты полученные с телескопа который находится на околоземной орбите. Фотографии загружаются непосредственно с сервера Nasa. Высокая детализация и качество изображения полностью соответствуют всем мировым стандартам",
    fotoDay: `<svg class ="svg-icon" viewBox="0 0 64 64"  xmlns="http://www.w3.org/2000/svg"><path d="M11 16c-1.208 0-2 .857-2 1.696v25.608C9 44.143 9.792 45 11 45h32.5c1.208 0 2-.857 2-1.696V17.696c0-.839-.792-1.696-2-1.696H11zm-4 1.696C7 15.556 8.894 14 11 14h32.5c2.106 0 4 1.557 4 3.696v1.131l3.76-2.608c1.254-1.09 2.912-1.226 4.237-.733 1.344.5 2.503 1.72 2.503 3.428v22.723c0 1.709-1.16 2.928-2.503 3.428-1.325.493-2.983.357-4.236-.733L47.5 41.722v1.581c0 2.14-1.894 3.696-4 3.696H11c-2.106 0-4-1.557-4-3.696V17.696zm40.5 21.597a1 1 0 0 1 .07.045l4.93 3.42.047.041c.63.567 1.507.669 2.252.391.744-.277 1.201-.86 1.201-1.553V18.914c0-.693-.457-1.277-1.2-1.554-.746-.277-1.622-.175-2.253.391l-.047.042-4.93 3.42a1 1 0 0 1-.07.044v18.036z"/><path d="M15 24.417a1 1 0 0 1 1 1v7.833a2 2 0 0 0 2 2h1.167a1 1 0 1 1 0 2H18a4 4 0 0 1-4-4v-7.833a1 1 0 0 1 1-1zm7.5 0a1 1 0 0 1 1 1v.866a1 1 0 1 1-2 0v-.866a1 1 0 0 1 1-1zm0 3.466a1 1 0 0 1 1 1v7.367a1 1 0 1 1-2 0v-7.367a1 1 0 0 1 1-1zM24.73 24.037a1 1 0 0 1 1.233.692l2.787 9.91 2.787-9.91a1 1 0 0 1 1.926.542l-2.788 9.91c-.547 1.945-3.303 1.945-3.85 0l-2.788-9.91a1 1 0 0 1 .692-1.234zM34 26a2 2 0 0 1 2-2h4a1 1 0 1 1 0 2h-4v3.417h4a1 1 0 1 1 0 2h-4v3.416h4a1 1 0 1 1 0 2h-4a2 2 0 0 1-2-2V26z"/></svg>`,
    fotoDayTitle: "Фото дня",
    fotoDayText:
      "На этой странице все наши посетители смогут посмотреть ФОТО ДНЯ, которое на соей странице в интернете ежедневно выкладывает NASA. Вы пропустили очередное фото? Далекие галактики, туманности, планеты нашей солнечной системы и интересные места на нашей планете. Вы найдете очень много занимательной информации. ",
    roverFoto: `<svg class ="svg-icon" viewBox="0 0 64 64"  xmlns="http://www.w3.org/2000/svg">
    <path d="M10 43a2 2 0 0 1 2-2h7a2 2 0 0 1 2 2v12a2 2 0 0 1-2 2h-7a2 2 0 0 1-2-2V43zm9 0h-7v12h7V43zM10 11a2 2 0 0 1 2-2h7a2 2 0 0 1 2 2v12a2 2 0 0 1-2 2h-7a2 2 0 0 1-2-2V11zm9 0h-7v12h7V11zM43 11a2 2 0 0 1 2-2h7a2 2 0 0 1 2 2v12a2 2 0 0 1-2 2h-7a2 2 0 0 1-2-2V11zm9 0h-7v12h7V11zM43 43a2 2 0 0 1 2-2h7a2 2 0 0 1 2 2v12a2 2 0 0 1-2 2h-7a2 2 0 0 1-2-2V43zm9 0h-7v12h7V43zM28 16a2 2 0 0 1 2-2h4a2 2 0 0 1 2 2v2a2 2 0 0 1-2 2h-4a2 2 0 0 1-2-2v-2zm6 0h-4v2h4v-2z"/>
    <path d="M22.993 16.12c.219-.08.45-.12.683-.12H28a1 1 0 1 1 0 2h-4.324l-4.703 1.71a2 2 0 0 1-1.079 1.46l-2.552 1.277a2 2 0 0 1-2.684-.894l-.084-.17a2 2 0 0 1 .976-2.722l.812 1.828.085.17L17 19.381v-.066l-2.638 1.173-.812-1.828 2.67-1.187a2 2 0 0 1 2.14.331l4.633-1.685zM40.007 16.12c-.219-.08-.45-.12-.683-.12H35a1 1 0 1 0 0 2h4.324l4.703 1.71a2 2 0 0 0 1.079 1.46l2.552 1.277a2 2 0 0 0 2.684-.894l.084-.17a2 2 0 0 0-.976-2.722l-.812 1.828-.085.17L46 19.381v-.066l2.638 1.173.812-1.828-2.67-1.187a2 2 0 0 0-2.14.331l-4.633-1.685zM23 28a2 2 0 0 1 2-2h14a2 2 0 0 1 2 2v18a2 2 0 0 1-2 2H25a2 2 0 0 1-2-2V28zm16 0H25v18h14V28z"/>
    <path d="M26 31a1 1 0 0 1 1-1h9.5a1 1 0 1 1 0 2H27a1 1 0 0 1-1-1zM26 35a1 1 0 0 1 1-1h9.5a1 1 0 1 1 0 2H27a1 1 0 0 1-1-1zM26 39a1 1 0 0 1 1-1h9.5a1 1 0 1 1 0 2H27a1 1 0 0 1-1-1zM26 43a1 1 0 0 1 1-1h9.5a1 1 0 1 1 0 2H27a1 1 0 0 1-1-1zM23.103 21.5H23a1 1 0 1 1 0-2h.271c1.224-.003 2.616-.006 3.8.473 1.41.57 2.406 1.748 2.9 3.791a1 1 0 0 1-1.943.471c-.377-1.557-1.017-2.129-1.708-2.408-.808-.327-1.828-.327-3.217-.327zM40.897 21.5H41a1 1 0 1 0 0-2h-.271c-1.224-.003-2.616-.006-3.8.473-1.41.57-2.406 1.748-2.9 3.791a1 1 0 0 0 1.943.471c.377-1.557 1.017-2.129 1.708-2.408.808-.327 1.828-.327 3.217-.327zM25 49a1 1 0 0 1 1 1v6h12v-6a1 1 0 1 1 2 0v6a2 2 0 0 1-2 2H26a2 2 0 0 1-2-2v-6a1 1 0 0 1 1-1zM30 10a4 4 0 0 0-4 4 1 1 0 1 1-2 0 6 6 0 0 1 6-6h4a6 6 0 0 1 6 6 1 1 0 1 1-2 0 4 4 0 0 0-4-4h-4z"/></svg>`,
    roverFotoTitle: "Фото марсоходов",
    roverFotoText:
      "Cамая удивительная страница нашего сайта. У вас есть возможность посмотреть фотографии марсоходов. Давайте вспомним их названия - Curiosity,Opportunity и конечно же Spirit. Фотографии выбираются на конкретный сол и с каждой камеры марсохода.",
    meteors: `<svg class ="svg-icon" viewBox="0 0 64 64" xmlns="http://www.w3.org/2000/svg"><path d="M34.746 28.739c-2.598-7.684-8.78-13.88-16.543-14.332l.117-1.996c8.829.514 15.553 7.502 18.32 15.687 2.773 8.2 1.696 17.95-5.48 24.148l-1.307-1.514c6.389-5.518 7.486-14.324 4.893-21.993z" /><path  d="M25.9 53.495a2.5 2.5 0 1 0 4.76-1.53 2.5 2.5 0 0 0-4.76 1.53zm-.952.307a3.5 3.5 0 1 0 6.663-2.143 3.5 3.5 0 0 0-6.663 2.143z" /><path d="M48.4 41.889a.5.5 0 0 1-.102.7L30.925 55.528a.5.5 0 1 1-.598-.802L47.7 41.786a.5.5 0 0 1 .7.103z"/><path d="M49.41 43.31a1.5 1.5 0 1 1-.918-2.857 1.5 1.5 0 0 1 .918 2.856z"/><path d="M13.349 14.464a2.5 2.5 0 1 1 4.76-1.53 2.5 2.5 0 0 1-4.76 1.53zm-.952.306a3.5 3.5 0 1 1 6.663-2.143 3.5 3.5 0 0 1-6.663 2.143z" /><path d="M38.397 10.78a.5.5 0 0 0-.491-.508l-21.659-.389a.5.5 0 1 0-.018 1l21.659.389a.5.5 0 0 0 .509-.491z"/><path d="M38.39 9.038a1.5 1.5 0 1 0 .918 2.856 1.5 1.5 0 0 0-.918-2.856z"/></svg>`,
    meteorsTitle: "Астероиды",
    meteorsText:
      "Это раздел нашего сайта подойдет тем, кто не любит красивые картинки, а предпочитает копаться в цифрах. На выбранные вами даты мы предоставим все околоземные объекты которые пролетят в непосредственной близости от земли.",
    marsWeather: `<svg class ="svg-icon" viewBox="0 0 32 32" xmlns="http://www.w3.org/2000/svg"><path d="M22.91 1.734l.778.086.086.777a.303.303 0 0 0 .602 0l.086-.777.777-.086a.303.303 0 0 0 0-.602l-.777-.086-.087-.776a.302.302 0 0 0-.602 0l-.086.778-.777.085a.303.303 0 0 0 0 .601zM1.566 6.544l.506.056.056.506a.303.303 0 0 0 .602.001l.056-.507.506-.056a.303.303 0 0 0 .001-.602l-.507-.056-.056-.506a.303.303 0 0 0-.602.001l-.056.505-.506.056a.303.303 0 0 0 0 .602zM5.755 2.246a.301.301 0 0 0 .428 0l.432-.432a.303.303 0 0 0 0-.429L6.183.953a.303.303 0 0 0-.428 0l-.432.432a.303.303 0 0 0 0 .428l.432.433zm.214-.651l.004.004-.004.005-.004-.005.004-.004zM12.393 1.381a.301.301 0 0 0 .428 0l.432-.432a.303.303 0 0 0 0-.428l-.432-.432a.303.303 0 0 0-.428 0l-.432.432a.303.303 0 0 0 0 .428l.432.432zm.214-.65l.004.004-.004.004-.004-.004.004-.004zM30.448 10.598a.303.303 0 0 0 .428 0l.432-.432a.303.303 0 0 0 0-.428l-.432-.432a.303.303 0 0 0-.428 0l-.432.432a.303.303 0 0 0 0 .428l.432.432zm.214-.65l.004.004-.004.004-.004-.004.004-.004zM27.077 4.817a.303.303 0 0 0 .428 0l.432-.432a.303.303 0 0 0 0-.428l-.432-.432a.303.303 0 0 0-.428 0l-.432.432a.303.303 0 0 0 0 .428l.432.432zm.214-.65l.004.004-.004.004-.004-.004.004-.004zM2.246 13.218l-.432-.432a.31.31 0 0 0-.428 0l-.432.432a.303.303 0 0 0 0 .428l.432.432a.303.303 0 0 0 .428 0l.432-.432a.303.303 0 0 0 0-.428zm-.647.219l-.004-.004.004-.004.004.004-.004.004zM7.196 29.46l-.858-.097-.095-.882a.303.303 0 0 0-.602 0l-.095.882-.858.097a.303.303 0 0 0 0 .602l.858.097.095.883a.303.303 0 0 0 .602 0l.095-.882.858-.097a.303.303 0 0 0 0-.603zM31.425 26.378l-.805-.089-.089-.805a.303.303 0 0 0-.602.001l-.089.805-.805.089a.303.303 0 0 0 .001.602l.805.089.089.805a.303.303 0 0 0 .602.001l.089-.805.805-.089a.303.303 0 0 0-.001-.604zM25.806 27.14a.31.31 0 0 0-.428 0l-.432.432a.303.303 0 0 0 0 .428l.432.432a.303.303 0 0 0 .428 0l.432-.432a.303.303 0 0 0 0-.428l-.432-.432zm-.214.651l-.004-.004.004-.004.004.004-.004.004zM19.926 30.362a.303.303 0 0 0-.428 0l-.432.432a.303.303 0 0 0 0 .428l.432.432a.303.303 0 0 0 .428 0l.432-.432a.303.303 0 0 0 0-.428l-.432-.432zm-.214.65l-.004-.004.004-.004.004.004-.004.004zM.949 17.835a.303.303 0 0 0-.428 0l-.432.432a.303.303 0 0 0 0 .428l.432.432a.301.301 0 0 0 .428 0l.432-.432a.303.303 0 0 0 0-.428l-.432-.432zm-.214.651l-.004-.004.004-.004.004.004-.004.004zM3.191 26.601a.303.303 0 0 0-.428 0l-.433.432a.303.303 0 0 0 0 .428l.432.432a.303.303 0 0 0 .428 0l.432-.432a.303.303 0 0 0 0-.428l-.431-.432zm-.214.65l-.004-.004.004-.004.004.004-.004.004zM32.172 19.66l-.432-.432a.302.302 0 0 0-.428 0l-.432.432a.303.303 0 0 0 0 .428l.432.432a.303.303 0 0 0 .428 0l.432-.432a.303.303 0 0 0 0-.428zm-.646.219l-.004-.004.004-.004.004.004-.004.004zM27.241 23.561a12.964 12.964 0 0 0 2.311-7.398c0-7.19-5.849-13.039-13.039-13.039a12.966 12.966 0 0 0-7.397 2.309C5.71 7.788 3.474 11.718 3.474 16.162c0 7.189 5.849 13.038 13.038 13.038 4.414 0 8.32-2.207 10.681-5.573a.445.445 0 0 0 .048-.066zm1.503-7.399c0 2.562-.793 4.942-2.145 6.909-1.999 1.241-4.654 2.042-6.796 2.042-2.14 0-4.246-.56-6.09-1.62a12.234 12.234 0 0 1-3.59-3.129 12.143 12.143 0 0 1-2.558-7.488 12.25 12.25 0 0 1 .593-3.774 12.17 12.17 0 0 1 1.499-3.064 12.163 12.163 0 0 1 6.855-2.107c6.745 0 12.232 5.487 12.232 12.231zM16.512 28.394c-6.744 0-12.231-5.487-12.231-12.231 0-3.414 1.408-6.505 3.671-8.726a12.99 12.99 0 0 0-.562 1.416 13.115 13.115 0 0 0-.623 4.52 12.94 12.94 0 0 0 2.717 7.485 13.048 13.048 0 0 0 3.825 3.335 13.05 13.05 0 0 0 6.493 1.727c1.702 0 3.705-.474 5.493-1.259a12.189 12.189 0 0 1-8.783 3.733z"/><path d="M23.442 11.529c.406 0 .768-.127 1.033-.393.374-.374.487-.941.319-1.596-.149-.581-.509-1.178-1.014-1.683-1.114-1.114-2.555-1.419-3.279-.695-.725.725-.42 2.166.694 3.28.707.706 1.544 1.087 2.247 1.087zm-2.37-3.796c.105-.104.268-.158.467-.158.452 0 1.092.274 1.671.853.398.398.691.877.803 1.313.093.363.054.663-.108.825-.342.342-1.304.14-2.138-.694-.835-.836-1.036-1.798-.695-2.139zM9.465 14.057c-.294.17-.484.488-.52.873-.032.339.056.707.246 1.037.311.538.813.851 1.288.851a.991.991 0 0 0 .504-.134c.579-.335.7-1.174.275-1.91a1.774 1.774 0 0 0-.776-.731c-.351-.162-.722-.156-1.017.014zm.681.719a.978.978 0 0 1 .413.401c.2.346.175.719.02.808-.155.09-.489-.075-.689-.422a.976.976 0 0 1-.141-.558c.005-.057.028-.196.12-.249a.198.198 0 0 1 .098-.024c.072 0 .144.028.179.044zM24.527 11.269c-.458.459-.346 1.289.255 1.891.353.352.784.537 1.172.536a.996.996 0 0 0 .718-.281c.236-.236.33-.59.257-.97-.063-.328-.245-.655-.512-.921s-.594-.449-.921-.512c-.379-.075-.732.02-.969.257zm.571.57c.03-.03.082-.045.147-.045.03 0 .063.004.098.01.168.032.352.138.504.29.152.152.257.335.29.504.021.11.008.202-.035.246-.1.097-.448.047-.749-.255-.302-.302-.353-.651-.255-.75zM20.18 14.723c.298 0 .617-.132.873-.389.458-.459.519-1.117.139-1.497-.381-.381-1.038-.32-1.497.138a1.26 1.26 0 0 0-.387.874.87.87 0 0 0 .248.623.864.864 0 0 0 .624.251zm.086-1.176a.464.464 0 0 1 .305-.151c.025 0 .043.005.05.012.027.027.02.196-.139.355-.16.16-.329.165-.356.138-.005-.006-.011-.024-.011-.052 0-.073.04-.191.151-.302zM13.894 17.713a.896.896 0 0 0-.508.636c-.06.256-.03.542.083.805.201.467.605.752 1.008.752a.835.835 0 0 0 .331-.068c.495-.212.682-.846.426-1.442-.258-.596-.845-.897-1.34-.683zm.597 1.002c.089.207.032.367-.003.382-.037.014-.19-.054-.279-.261a.507.507 0 0 1-.039-.302c.012-.05.032-.075.041-.079a.037.037 0 0 1 .012-.002c.051-.001.187.073.268.262zM12.468 9.355c.159.238.383.419.63.508a.99.99 0 0 0 .338.061.84.84 0 0 0 .472-.14.894.894 0 0 0 .384-.718 1.3 1.3 0 0 0-.227-.776c-.36-.54-.993-.728-1.441-.429a.895.895 0 0 0-.384.719c-.013.26.068.536.228.775-.001 0-.001 0 0 0zm.604-.824c.032-.023.196.017.322.206.063.095.097.2.093.29-.002.049-.017.079-.026.086-.009.006-.04.008-.089-.009a.506.506 0 0 1-.233-.197.509.509 0 0 1-.093-.29c.002-.05.017-.08.026-.086z"/></svg>`,
    marsWeatherTitle: "Погода на марсе",
    marsWeatherText:
      "Посмотрите за окно. Дождь или солнце? Как вообще погодка. А что делать если надо узать погоду на Марсе? Все очень просто! Откройте соответствующий раздел нашей программы и вы узнаете всю необходимые данные на указанную дату. Вперед! Узнайте уже, есть ли жизнь на Марсе!",
  };

  let epic = document.querySelector("#epic");
  let epicIcon = epic.querySelector(".icon");

  let fotoDay = document.querySelector("#foto-day");
  let fotoDayIcon = fotoDay.querySelector(".icon");

  let roverFoto = document.querySelector("#rover-foto");
  let roverFotoIcon = roverFoto.querySelector(".icon");

  let meteors = document.querySelector("#near-object");
  let meteorsIcon = meteors.querySelector(".icon");

  let marsWeather = document.querySelector("#mars-weather");
  let marsWeatherIcon = marsWeather.querySelector(".icon");

  epicIcon.style.fill = "rgb(161,158,168)";
  fotoDayIcon.style.fill = "rgb(161,158,168)";
  roverFotoIcon.style.fill = "rgb(161,158,168)";
  marsWeatherIcon.style.fill = "rgb(161,158,168)";
  meteorsIcon.style.fill = "rgb(161,158,168)";

  let elemSlicker = document.querySelector(".progresstab__slicker");
  elemSlicker.remove();
  let slicker = document.createElement(`div`);
  slicker.className = "progresstab__slicker";
  e.currentTarget.append(slicker);

  let elemMenu = elem.querySelector(".svg-menu");
  let elemTitle = elem.querySelector(".main-menu__name");
  let elemText = elem.querySelector(".main-menu__text");

  if (e.currentTarget.id === "epic") {
    epicIcon.style.fill = "rgb(68, 219, 181)";
    elemMenu.innerHTML = menu.epic;
    elemTitle.innerHTML = menu.epicTitle;
    elemText.innerHTML = menu.epicText;
  } else if (e.currentTarget.id === "foto-day") {
    fotoDayIcon.style.fill = "rgb(68, 219, 181)";
    elemMenu.innerHTML = menu.fotoDay;
    elemTitle.innerHTML = menu.fotoDayTitle;
    elemText.innerHTML = menu.fotoDayText;
  } else if (e.currentTarget.id === "rover-foto") {
    roverFotoIcon.style.fill = "rgb(68, 219, 181)";
    elemMenu.innerHTML = menu.roverFoto;
    elemTitle.innerHTML = menu.roverFotoTitle;
    elemText.innerHTML = menu.roverFotoText;
  } else if (e.currentTarget.id === "near-object") {
    meteorsIcon.style.fill = "rgb(68, 219, 181)";
    elemMenu.innerHTML = menu.meteors;
    elemTitle.innerHTML = menu.meteorsTitle;
    elemText.innerHTML = menu.meteorsText;
  } else {
    marsWeatherIcon.style.fill = "rgb(68, 219, 181)";
    elemMenu.innerHTML = menu.marsWeather;
    elemTitle.innerHTML = menu.marsWeatherTitle;
    elemText.innerHTML = menu.marsWeatherText;
  }
}
